<span style="font-size: 36px;">W4111_2025_002_1: Introduction to Databases:<br>Homework 3A</span>

# Overview

## Scope

The material in scope for this homework is:
- The content of lectures:
    - This includes all of the meterial covered in the lectures.
    - All of the material in the slides from lectures 1, 2, and 3. Students should read slides not covered in the lecture.
    - Lecture 4 slides except for the slides after slide 88.
    - Lecture 5 slides from slide 1 to slide 57.
- The slides associated with the recommended textbook for
    - Chapter 1.
    - Chapter 2.
    - Chapter 3.
    - Chapter 4 slides 4.4 to 4.52 except for slide 4.35 (Transactions).

## Submission Instructions

- Due date: 2025-Mar-09, 11:59 PM EDT on GradeScope.

- You submit on GradeScope. We will create a GradeScope submission for the homework.

- Your submission is a PDF of this notebook. You must tag the submission with locations in the PDF for each question. You must solve problems you experience producing a PDF including images. Please do not wait until the last minute.

There is a [post/mega-thread](https://edstem.org/us/courses/73023/discussion/6235789) on Ed Discussions that we will use to resolve questions and issues with respect to homework 3.

## Brevity

| <img src="einstein-quote.jpg"> |
| :---: |
| __Brevity__ |

Students sometimes just write a lot of words hoping to get something right. We will deduct points if your answer is too long.

# Initialization

## Python Environment

In [1]:
import copy

In [2]:
import json

In [3]:
import pandas

In [8]:
# You should have installed the packages for previous homework assignments
#
import pymysql
import sqlalchemy
from sqlalchemy import create_engine

In [9]:
import numpy

In [10]:
# You have installed and configured ipython-sql for previous assignments.
# https://pypi.org/project/ipython-sql/
#
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
# This is a hack to fix a version problem/incompatibility  with some of the packages and magics.
#
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [12]:
# Make sure that you set these values to the correct values for your installation and 
# configuration of MySQL
#
db_user = "root"
db_password = "dbuserdbuser"

In [13]:
# Create the URL for connecting to the database.
# Do not worry about the local_infile=1, I did that for wizard reasons that you should not have to use.
#
db_url = f"mysql+pymysql://{db_user}:{db_password}@localhost?local_infile=1"

In [14]:
# Initialize ipython-sql
#
%sql $db_url

In [15]:
# Your answer will be different based on the databases that you have created on your local MySQL instance.
#
%sql show tables from db_book

 * mysql+pymysql://root:***@localhost?local_infile=1
15 rows affected.

[('advisor',),
 ('classroom',),
 ('course',),
 ('department',),
 ('hw3_student',),
 ('hw3_student_simple_1',),
 ('hw3_student_simple_2',),
 ('instructor',),
 ('instructor_public',),
 ('prereq',),
 ('section',),
 ('student',),
 ('takes',),
 ('teaches',),
 ('time_slot',)]

In [16]:

default_engine = create_engine(db_url)

In [17]:
result_df = pandas.read_sql(
    "show tables from db_book", con=default_engine
)
result_df

       Tables_in_db_book
0                advisor
1              classroom
2                 course
3             department
4            hw3_student
5   hw3_student_simple_1
6   hw3_student_simple_2
7             instructor
8      instructor_public
9                 prereq
10               section
11               student
12                 takes
13               teaches
14             time_slot

## Load Classic Models Dataset

You must load the ```classicmodels``` MySQL [sample database.](https://www.mysqltutorial.org/getting-started-with-mysql/mysql-sample-database/)

You can use DataGrip and follow the process/tasks you did in HW 0 to load ```db_book.``` The page describing the dataset also links a tutorial on how to load the dataset. The installation file is a set of SQL DDL and DML statements. You ran a file with similar statements for HW 0.

The following query tests correct loading.

In [18]:
%%sql

use classicmodels;

with one as (select customerNumber,
                    (select customerName
                     from customers
                     where customers.customerNumber = orders.customerNumber) as customerName,
                 orderNumber
             from orders
             where (select country from customers where customers.customerNumber = orders.customerNumber) = 'Spain'),
two as (
    select
        *
    from one join orderdetails using(orderNumber)
)
select
    customerNumber, customerName,
    count(*) as noOfOrders,
    concat("$", format(sum(quantityOrdered*priceEach), 2)) as revenue
from two
group by customerNumber, customerName
having sum(quantityOrdered*priceEach) >= 50000
order by sum(quantityOrdered*priceEach) desc;

 * mysql+pymysql://root:***@localhost?local_infile=1
0 rows affected.
4 rows affected.

[(141, 'Euro+ Shopping Channel', 259, '$820,689.54'),
 (458, 'Corrida Auto Replicas, Ltd', 32, '$112,440.09'),
 (216, 'Enaco Distributors', 23, '$68,520.47'),
 (484, 'Iberia Gift Imports, Corp.', 15, '$50,987.85')]

# Written Questions

## IsA

_Question_

Briefly explain the concepts of:
- Inheritance/specialization/generalization.
- Incomplete/complete.
- Disjoint/overlapping.

_Answer_

Place your answer here.

## Views

_Question_

Views are a powerful concept in relational databases, and databases in general. Succinctly give 3 motivations for/reasons to use views.

_Answer_

Please your answer here.

## Types of Views

_Question_

Consider the following SQL statement that creates a view.

```
with one as (select customerNumber,
                    (select customerName
                     from customers
                     where customers.customerNumber = orders.customerNumber) as customerName,
                 orderNumber
             from orders),
two as (
    select
        *
    from one join orderdetails using(orderNumber)
)
select
    customerNumber, customerName,
    count(*) as noOfOrders,
    concat("$", format(sum(quantityOrdered*priceEach), 2)) as revenue
from two
group by customerNumber, customerName
having sum(quantityOrdered*priceEach) >= 50000
order by sum(quantityOrdered*priceEach) desc;
```

Assume that:
1. The total number of orders over all customers is very large.
2. There are relatively few customers.
3. Many users frequently query (read) the view.
4. The rate of updating an order or creating and order is small.

What type of view would you use and why?

_Answer_

Please your answer here.

## View Expanson

_Question_

Consider the following SQL statements:

```
create or replace view hw3_customerSummary as select
    customerNumber, customerName, contactFirstName, contactLastName, phone as contactPhone, salesRepEmployeeNumber
from
    customers;

create or replace view hw3_customersAndSales as
select
    customerNumber, customerName, contactFirstName, contactLastName, contactPhone,
    employeeNumber as salesRepEmploueeNumber,
    concat(employees.lastName, ",", employees.firstName) as salesRepEmployeeName,
    email as saleRepEmployeeEmail
from
    hw3_customerSummary join employees on employeeNumber=salesRepEmployeeNumber;

```

Show the resulting query after view expansion for the following query.

```select * from hw3_customersAndSales;```

_Answer_

Please your answer here.

## View Updates

_Question_

Consider the following SQL DDL based on a modification of the ```db_book``` data model.

```
drop table if exists hw3_student;

create table if not exists db_book.hw3_student
(
    ID        varchar(5)  not null
        primary key,
    name      varchar(20) not null,
    dept_name varchar(20) null,
    tot_cred  decimal(3)  not null
);

create or replace view db_book.hw3_student_simple_1 as
    select ID, name, tot_cred from hw3_student;
create or replace view db_book.hw3_student_simple_2 as
    select ID, name from hw3_student;
```

For each views, state whether or not it is updateable and why.

_Answer_

Please your answer here.

## Fun with Joins

_Question_

Using the default dataset [UIBK - R, S, T](https://dbis-uibk.github.io/relax/calc/local/uibk/local/0), execute the following relational algebra expression (a full outer join):
```
S ⟗ T
```

The result is:

<img src="ST.jpg" width="250px;">

Write and execute a relational algebra expression that produces an equivalent result but does not use outer join.

_Answer_

Replace the statement and image below with your results.

```
S ⟗ T
```

<img src="ST2.jpg" width="300px;">

## Indexes

_Question_

Properly identifying and defining useful indexes is critical to database performance. Briefly explain:
1. Why do some databases automatically create indexes when the DDL defines primary, unique and foreign key constraints?
2. If indexes are useful, why doesn't the database engine automatically create every possible index?
3. The following is the DDL for ```student``` from the ```db_book``` database.  For the purposes of this question, a "scenario" is a hypothesis about the size of tables and the types of queries users submit. Define a scenario for which creating an additional index on ```student``` would be beneficial and why.

```
create table if not exists db_book.student
(
    ID        varchar(5)  not null
        primary key,
    name      varchar(20) not null,
    dept_name varchar(20) null,
    tot_cred  decimal(3)  null,
    constraint student_ibfk_1
        foreign key (dept_name) references db_book.department (dept_name)
            on delete set null,
    check (`tot_cred` >= 0)
);

create index dept_name
    on db_book.student (dept_name);
```

_Answer_

Please your answer here.

## Codd's Rule 7

_Question_

Codd's __Rule 7: High-Level Insert, Update, and Delete Rule__


A database must support high-level insertion, updation, and deletion. This must not be limited to a single row, ... ...

Briefly explain and give examples of how SQL realizes/implements this rule.

_Answer_

Please your answer here.

## Complex Attributes

_Question_

Consider the following Python code that processes some information about _Game of Thrones._

In [19]:
fn = "s2025_episodes.json"

with open(fn, "r") as in_file:
    got_episodes = json.load(in_file)

for g in got_episodes:
    g["openingSequenceLocations"] = ";".join(g["openingSequenceLocations"])

got_episodes_df = pandas.DataFrame(got_episodes)

got_episodes_df

,seasonNum,episodeNum,episodeTitle,episodeAirDate,openingSequenceLocations
0,1,1,Winter Is Coming,2011-04-17,King's Landing;Winterfell;The Wall;Pentos
1,1,2,The Kingsroad,2011-04-24,King's Landing;Winterfell;The Wall;Vaes Dothrak
2,1,3,Lord Snow,2011-05-01,King's Landing;Winterfell;The Wall;Vaes Dothrak
3,1,4,"Cripples, Bastards, and Broken Things",2011-05-08,King's Landing;Winterfell;The Wall;Vaes Dothrak
4,1,5,The Wolf and the Lion,2011-05-15,King's Landing;The Eyrie;Winterfell;The Wall;V...
...,...,...,...,...,...
68,8,2,A Knight of the Seven Kingdoms,2019-04-21,Last Hearth;Winterfell;King's Landing
69,8,3,The Long Night,2019-04-28,Last Hearth;Winterfell;King's Landing
70,8,4,The Last of the Starks,2019-05-05,Last Hearth;Winterfell;King's Landing
71,8,5,The Bells,2019-05-12,Last Hearth;Winterfell;King's Landing
72,8,6,The Iron Throne,2019-05-19,Last Hearth;Winterfell;King's Landing

Assume that I want to store the resulting dataframe in a relational database.

Draw a Crow's Foot logical ER diagram for the data model I should use. Replace the image below with your image. You may add explanatory notes if you wish.

_Answer_

<img src="empty-er.jpg">

## Two Critical Concepts in Relationships

_Question_

Two critical concepts in entity relationships are _degree_ and _cardinality._ Briefly explain the concepts.

_Answer_

Please your answer here.

# Practical Questions

## Metadata

_Question_

The following MySQL operation generates a basic description of a table.

In [20]:
%sql describe db_book.student;

 * mysql+pymysql://root:***@localhost?local_infile=1
4 rows affected.

[('ID', 'varchar(5)', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'NO', '', None, ''),
 ('dept_name', 'varchar(20)', 'YES', 'MUL', None, ''),
 ('tot_cred', 'decimal(3,0)', 'YES', '', None, '')]

Examine the ```views``` and ```tables``` in ```information_schema.``` Write a simple SQL DML query that produces the information above. Your answer does not have to have the same format.

_Answer_

Please place and execute your SQL statement below.

In [ ]:
%%sql

## Tricky SQL 1

_Question_

Consider the following query. __Note__ that I used ```limit 10``` just to keep the answer short.

In [21]:
%%sql

use classicmodels;

with one as (
    select customerNumber, count(*) as numberOfOrders,
           sum(quantityOrdered*priceEach) as totalRevenue
    from orders join orderdetails using(orderNumber) group by customerNumber
)
select * from one
limit 10;

 * mysql+pymysql://root:***@localhost?local_infile=1
0 rows affected.
10 rows affected.

[(103, 7, Decimal('22314.36')),
 (112, 29, Decimal('80180.98')),
 (114, 55, Decimal('180585.07')),
 (119, 53, Decimal('158573.12')),
 (121, 32, Decimal('104224.79')),
 (124, 180, Decimal('591827.34')),
 (128, 22, Decimal('75937.76')),
 (129, 21, Decimal('66710.56')),
 (131, 49, Decimal('149085.15')),
 (141, 259, Decimal('820689.54'))]

Modify the query so that the results contains:
- The customer's ```customerName``` and the customer's ```country.```
- Only contains customers whose country is ```Spain```

__You must not use a JOIN.__

_Answer_

In [ ]:
%%sql

/* Place and execute your SQL here. */

## Tricky SQL 2

_Question_

Use the ```db_book``` database for this problem.

We want to compute a relation of the form $(course\_id, course\_title, prereq\_course\_id, prereq\_course\_title)$ that lists courses and their prereqs. If a course does not have a prereq, $prereq\_course\_id$ and $prereq\_course\_title$ should be ```NULL.``` If a course is not a prereq for any other course, it should appear in the result with $course\_id$ and $course\_title$ both ```NULL.```

Write an SQL query that produces the table. To help, the result of running my solution is below.


| <img src="course-prereq.jpg" width="900px"> |
| :---: |
| __Course-Prereqs__ |

_Answer_

In [ ]:
%%sql

/* Place and execute your SQL here. */

## ER Diagram and DDL

_Question_

Consider the following scenario. There are 6 entity types.
1. ```BaseProduct``` that has attributes:
    - ```product_id```
    - ```product_name```
    - ```product_description```
    - ```price```
2. ```DurableProduct``` __isA__ ```BaseProduct``` and has the attributes:
    - ```height```
    - ```width```
    - ```depth```
    - ```weight```
3. ```EntertainmentProduct``` __isA__ a ```BaseProduct``` and has the attributes:
    - ```copyright_date```
    - ```version_no```
    - ```artist_first_name```
    - ```artist_last_name```
4. ```MusicProduct``` __isA__ an ```EntertainmentProduct``` an has the attributes:
    - ```no_of_seconds```
    -  ```genre```
5. ```BookProduct``` __isA__ an ```EntertainmentProduct``` and has the attributes:
    - ```no_of_pages```
    - ```printing_no```
6. ```Supplier``` has the attributes:
    - ```supplier_id```
    - ```supplier_name```

A product is either a ```DurableProduct,``` an ```EntertainmentProduct``` or just a ```BaseProduct.``` There are no products that are both durable and entertainment. All ```EntertainmentProducts``` are either a book or a music product but not both. Every product has _exactly_ one ```Supplier.``` A ```Supplier``` may supply several products. 

Draw a Crow's Foot ER Diagram for the logical model for this scenario. You may have to add attributes to the lists above to implement define the model. Specify whether you are choosing the one, two or three table design. You should also specify which views you would create. 

You should indicate __all foreign keys.__

_Answer_

Place a screenshot of you diagram here and replace this image, which is some symbols.

| <img src="er-symbols.jpg" width="900px"> |
| :---: |
| __Some Symbols and Notation__ |

Please place and execute your SQL statement below.

## I Told You that You Would Have to Look Up Functions SQL Question

_Question_

The following result table uses ```section``` and ```time_slot``` from ```db_book.```

| <img src="sections-times.jpg" width="900px"> |
| :---: |
| __Using Functions__ |

Write an SQL query that produces the table. You will have to look for some SQL functions to use. You can use the web, ChatGPT, etc. to find the documentation on the functions.

The order of the multiple day classes must be "MWF" or "TR." Other orders, e.g. "FMW" are not acceptable.

_Answer_

In [ ]:
%%sql
/*
    Write and execute your answer.
*/